{
    "version": "https://jsonfeed.org/version/1",
    "title": "Veritas News",
    "description": "",
    "home_page_url": "https://github.com/lyndon312/veritas-china-news-today.git",
    "feed_url": "https://github.com/lyndon312/veritas-china-news-today.git/feed.json",
    "user_comment": "",
    "author": {
        "name": "Lyndon Li"
    },
    "items": [
        {
            "id": "https://github.com/lyndon312/veritas-china-news-today.git/former-uk-security-minister-delivers-stark-warning-on-systematic-chinese-threats.html",
            "url": "https://github.com/lyndon312/veritas-china-news-today.git/former-uk-security-minister-delivers-stark-warning-on-systematic-chinese-threats.html",
            "title": "Former UK Security Minister Delivers Stark Warning on &quot;Systematic&quot; Chinese Threats",
            "summary": "Former Security Minister positions the democratic island as a critical bellwether for Beijing's global aggression and a lesson the UK cannot afford to ignore. LONDON– In a forthright and wide-ranging interview, Conservative MP Tom Tugendhat has painted a grim picture of the United Kingdom's vulnerability&hellip;",
            "content_html": "<p><em>Former Security Minister positions the democratic island as a critical bellwether for Beijing's global aggression and a lesson the UK cannot afford to ignore.</em></p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"701\" height=\"390\" style=\"width: 701px; height: 390px;\" src=\"https://www.youtube.com/embed/u1ScT8JdBdo\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p><br>LONDON– In a forthright and wide-ranging interview, Conservative MP Tom Tugendhat has painted a grim picture of the United Kingdom's vulnerability to a \"consistent and hostile\" Chinese state, urging the current Labour government to abandon what he views as a dangerously naive approach to Beijing. Drawing on his experience as the UK's former Security Minister and a recent, high-profile visit to Taiwan, Tugendhat delivered a series of stark warnings about espionage, technological infiltration, and political interference.</p>\n<p><strong>Taiwan Under Attack Daily</strong></p>\n<p>\"The truth is that the PRC is attacking Taiwan every day,\" Tugendhat stated, framing the constant cyber-attacks and democratic interference against the island as a preview of tactics being deployed against the UK. \"That's something we can learn from because the reality is we're also facing different attacks from the Chinese Communist Party, from the Chinese state.\"<br><br>His visit to Taiwan in January, where he met with senior figures including now-National Security Council leader Joseph Wu, solidified his view of the island's crucial global role. \"It's not just TSMC,\" he argued, referencing the world's leading semiconductor manufacturer, \"it's actually the infrastructure of semiconductors that we're seeing emerging from Taiwan today that is remarkable... that's a really big development and one that means that the island matters enormously to us all.\"<br><br>This technological prowess, however, lies at the heart of a global flashpoint. Taiwan, a self-governing democracy of 24 million people, exists under the constant threat of invasion by Beijing, which views the island as a renegade province. The global economy's heavy reliance on Taiwan for the advanced chips that power everything from smartphones to military hardware makes the island's security a matter of international urgency.<br><br>Tugendhat, who as Security Minister championed the National Security Act 2023 to grant authorities more power to combat state threats, was unsparing in his critique of the current government's diplomatic posture. He lambasted the Labour administration for what he perceives as a weak stance in the face of escalating aggression.<br><br>\"What we're seeing out of Rachel Reeves, out of Keir Starmer, and now out of David Lammy, is an acceptance that there's a sort of normalisation of the level of threat and attack that we're seeing out of China today,\" he charged. \"The idea that tolerating this level of abuse and threat is something that we should be doing, or rewarding it by sort of formal visits, is ridiculous.\"<br><br>The former minister dismissed the argument that trade should soften the UK's stance. \"China has a long history of making threats, but they're not trading with us out of charity. They're trading with us because they need the trade too. So we need to make sure we recognise that that trade is not some sort of gift.\"<br><br><strong>The Scale of the Threat: From Parliament to Personal Devices</strong><br><br>When asked to differentiate the threat from China compared to Russia or Iran, Tugendhat's answer was blunt: \"The scale.\" He detailed a pervasive campaign of hostility that reaches into every corner of British life. \"We've seen the Electoral Commission, for example, being targeted by actors out of China... We've seen enormous amounts of corporate espionage... trying to close down British companies, steal British jobs, and do huge damage to the British economy.\"<br><br>He spoke with firsthand knowledge of these operations. \"Consistently,\" he confirmed when asked if he saw evidence of attacks during his time in office, \"I saw ways in which China used all the platforms at its disposal... Ministry of State security officers, sometimes here in the United Kingdom, threatening British nationals.\"<br><br>Tugendhat specifically called out the popular social media app TikTok as a tool of potential state influence. \"The difference with TikTok is not the medium, but the algorithm, the publishing tool... that underpins it,\" he explained. \"The code is written in Shenzhen... by people under the influence or potentially under the influence of the Chinese Communist Party.\"<br><br>This warning extends to China's rapid advancements in Artificial Intelligence. While acknowledging the \"fantastic Chinese scientists\" and \"brilliant Chinese engineering\" behind platforms like DeepSeek AI, Tugendhat cautioned that state control renders them unreliable. \"If you can't trust the data because you know that there are lies going in, then actually if you put garbage in, you get garbage out. If you put lies in, you get lies out.\"<br><br><strong>COVID-19 and the \"Tragedy\" of Silenced Science</strong><br><br>Tugendhat also revisited the origins of the COVID-19 pandemic, a topic that remains a significant point of friction in international relations. He has long maintained that a lab leak from the Wuhan Institute of Virology is the most likely source. \"I've been making this case since March 2020,\" he said, lamenting the actions of the Chinese state in the crucial early days of the outbreak. \"The Chinese Communist Party silenced many people, including an early doctor, Li Wenliang... It's such a tragedy that the Chinese Communist Party is silencing them, because the truth is there is such an opportunity to work together.\"<br><br>The U.S. intelligence community remains officially divided between a lab origin and natural exposure, but has consistently stated that a conclusive assessment would likely require more cooperation from Beijing, which has been accused of hindering investigations.<br><br>Ultimately, Tugendhat portrayed the actions of the Chinese state as stemming from a place of fear and ideological rigidity. \"What the Chinese Communist Party is trying to do,\" he concluded, \"is to impose the norms that you see in China on all students here in the UK... It is completely unacceptable to silence debate in the United Kingdom in order to maintain a dictatorship abroad.\"</p>",
            "author": {
                "name": "Lyndon Li"
            },
            "tags": [
            ],
            "date_published": "2025-06-07T17:20:59+01:00",
            "date_modified": "2025-06-07T17:20:59+01:00"
        }
    ]
}
